#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBDGameplay

#include "Basic.hpp"

#include "DBDGameplay_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DBDCosmetic_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeadByDaylight_structs.hpp"
#include "DeadByDaylight_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayUtilities_classes.hpp"
#include "DataTableUtilities_structs.hpp"
#include "NetworkUtilities_structs.hpp"
#include "DBDInteraction_classes.hpp"
#include "QueryService_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "StatSystem_structs.hpp"
#include "GameplayTagUtilities_structs.hpp"
#include "DBDSharedTypes_structs.hpp"
#include "AnimationUtilities_classes.hpp"


namespace SDK
{

// Class DBDGameplay.ActorNavMovementComponent
// 0x0028 (0x0198 - 0x0170)
class UActorNavMovementComponent : public UNavMovementComponent
{
public:
	class AActor*                                 _owningActor;                                      // 0x0170(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPathFollowingComponent*                _pathFollowingComponent;                           // 0x0178(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bPositionCorrected : 1;                            // 0x0180(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _maxSpeed;                                         // 0x0184(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _acceleration;                                     // 0x0188(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         _deceleration;                                     // 0x018C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAcceleration(float acceleration);
	void SetDeceleration(float deceleration);
	void SetMaxSpeed(float maxSpeed);

	class AActor* GetOwningActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorNavMovementComponent">();
	}
	static class UActorNavMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorNavMovementComponent>();
	}
};
static_assert(alignof(UActorNavMovementComponent) == 0x000008, "Wrong alignment on UActorNavMovementComponent");
static_assert(sizeof(UActorNavMovementComponent) == 0x000198, "Wrong size on UActorNavMovementComponent");
static_assert(offsetof(UActorNavMovementComponent, _owningActor) == 0x000170, "Member 'UActorNavMovementComponent::_owningActor' has a wrong offset!");
static_assert(offsetof(UActorNavMovementComponent, _pathFollowingComponent) == 0x000178, "Member 'UActorNavMovementComponent::_pathFollowingComponent' has a wrong offset!");
static_assert(offsetof(UActorNavMovementComponent, _maxSpeed) == 0x000184, "Member 'UActorNavMovementComponent::_maxSpeed' has a wrong offset!");
static_assert(offsetof(UActorNavMovementComponent, _acceleration) == 0x000188, "Member 'UActorNavMovementComponent::_acceleration' has a wrong offset!");
static_assert(offsetof(UActorNavMovementComponent, _deceleration) == 0x00018C, "Member 'UActorNavMovementComponent::_deceleration' has a wrong offset!");

// Class DBDGameplay.ActorPathFollowingComponent
// 0x0000 (0x02F8 - 0x02F8)
class UActorPathFollowingComponent : public UPathFollowingComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPathFollowingComponent">();
	}
	static class UActorPathFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPathFollowingComponent>();
	}
};
static_assert(alignof(UActorPathFollowingComponent) == 0x000008, "Wrong alignment on UActorPathFollowingComponent");
static_assert(sizeof(UActorPathFollowingComponent) == 0x0002F8, "Wrong size on UActorPathFollowingComponent");

// Class DBDGameplay.FootstepPerceptionComponent
// 0x0018 (0x00D0 - 0x00B8)
class UFootstepPerceptionComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _canSeeFootstepsDefaultValue;                      // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootstepPerceptionComponent">();
	}
	static class UFootstepPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepPerceptionComponent>();
	}
};
static_assert(alignof(UFootstepPerceptionComponent) == 0x000008, "Wrong alignment on UFootstepPerceptionComponent");
static_assert(sizeof(UFootstepPerceptionComponent) == 0x0000D0, "Wrong size on UFootstepPerceptionComponent");
static_assert(offsetof(UFootstepPerceptionComponent, _canSeeFootstepsDefaultValue) == 0x0000C8, "Member 'UFootstepPerceptionComponent::_canSeeFootstepsDefaultValue' has a wrong offset!");

// Class DBDGameplay.AimableComponent
// 0x0070 (0x0128 - 0x00B8)
class UAimableComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         _occlusionIgnoredActors;                           // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         _maxAimDistance;                                   // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAimDirectionProvider*                  _aimDirectionProvider;                             // 0x00D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _useOcclusion;                                     // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _aimPointLerpFactor;                               // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAimPointProcessor*>             _preOcclusionAimPointProcessors;                   // 0x00E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x30];                                      // 0x00F8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMaxAimDistance(float maxAimDistance);
	void SetOcclusionIgnoredActors(const TArray<class AActor*>& ignoredActors);
	void SetProcessors(const TArray<class UAimPointProcessor*>& processors);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimableComponent">();
	}
	static class UAimableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimableComponent>();
	}
};
static_assert(alignof(UAimableComponent) == 0x000008, "Wrong alignment on UAimableComponent");
static_assert(sizeof(UAimableComponent) == 0x000128, "Wrong size on UAimableComponent");
static_assert(offsetof(UAimableComponent, _occlusionIgnoredActors) == 0x0000C0, "Member 'UAimableComponent::_occlusionIgnoredActors' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _maxAimDistance) == 0x0000D0, "Member 'UAimableComponent::_maxAimDistance' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _aimDirectionProvider) == 0x0000D8, "Member 'UAimableComponent::_aimDirectionProvider' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _useOcclusion) == 0x0000E0, "Member 'UAimableComponent::_useOcclusion' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _aimPointLerpFactor) == 0x0000E4, "Member 'UAimableComponent::_aimPointLerpFactor' has a wrong offset!");
static_assert(offsetof(UAimableComponent, _preOcclusionAimPointProcessors) == 0x0000E8, "Member 'UAimableComponent::_preOcclusionAimPointProcessors' has a wrong offset!");

// Class DBDGameplay.IgnoreCollisionsHandlerComponent
// 0x0020 (0x05A0 - 0x0580)
class UIgnoreCollisionsHandlerComponent : public UBoxComponent
{
public:
	uint8                                         Pad_580[0x20];                                     // 0x0580(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IgnoreCollisionsHandlerComponent">();
	}
	static class UIgnoreCollisionsHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIgnoreCollisionsHandlerComponent>();
	}
};
static_assert(alignof(UIgnoreCollisionsHandlerComponent) == 0x000010, "Wrong alignment on UIgnoreCollisionsHandlerComponent");
static_assert(sizeof(UIgnoreCollisionsHandlerComponent) == 0x0005A0, "Wrong size on UIgnoreCollisionsHandlerComponent");

// Class DBDGameplay.IgnoreCollisionsWindowHandlerComponent
// 0x0000 (0x05A0 - 0x05A0)
class UIgnoreCollisionsWindowHandlerComponent : public UIgnoreCollisionsHandlerComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IgnoreCollisionsWindowHandlerComponent">();
	}
	static class UIgnoreCollisionsWindowHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIgnoreCollisionsWindowHandlerComponent>();
	}
};
static_assert(alignof(UIgnoreCollisionsWindowHandlerComponent) == 0x000010, "Wrong alignment on UIgnoreCollisionsWindowHandlerComponent");
static_assert(sizeof(UIgnoreCollisionsWindowHandlerComponent) == 0x0005A0, "Wrong size on UIgnoreCollisionsWindowHandlerComponent");

// Class DBDGameplay.RangedExplosive
// 0x0070 (0x0440 - 0x03D0)
class ARangedExplosive : public AInteractable
{
public:
	uint8                                         Pad_3D0[0x18];                                     // 0x03D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _debugDisplayEnabled;                              // 0x03E8(0x0001)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       _effectArea;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           _akComponent;                                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   _mesh;                                             // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UGameplayModifierContainer*>     _effectModifiers;                                  // 0x0408(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class ADBDPlayer*                             _owningPlayer;                                     // 0x0418(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _isExploding;                                      // 0x0420(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         _actorsInRange;                                    // 0x0428(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UBaseRangedExplosiveActorEffect*        _explosiveActorEffect;                             // 0x0438(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Multicast_InitFromSpawningPlayer(class ADBDPlayer* spawner);
	void OnExplode_BP();
	void OnFuseBurnEnter();
	void OnFuseBurnExit();
	void OnFuseBurnUpdate(float deltaSeconds, float fuseTimeLeftPercent);

	float GetExplosionEffectDuration() const;
	float GetExplosionRange() const;
	float GetModifierValue(const struct FGameplayTag& type) const;
	class ADBDPlayer* GetOwningPlayer() const;
	class UBaseRangedExplosiveActorEffect* GetRangedExplosiveActorEffect() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RangedExplosive">();
	}
	static class ARangedExplosive* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARangedExplosive>();
	}
};
static_assert(alignof(ARangedExplosive) == 0x000008, "Wrong alignment on ARangedExplosive");
static_assert(sizeof(ARangedExplosive) == 0x000440, "Wrong size on ARangedExplosive");
static_assert(offsetof(ARangedExplosive, _debugDisplayEnabled) == 0x0003E8, "Member 'ARangedExplosive::_debugDisplayEnabled' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _effectArea) == 0x0003F0, "Member 'ARangedExplosive::_effectArea' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _akComponent) == 0x0003F8, "Member 'ARangedExplosive::_akComponent' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _mesh) == 0x000400, "Member 'ARangedExplosive::_mesh' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _effectModifiers) == 0x000408, "Member 'ARangedExplosive::_effectModifiers' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _owningPlayer) == 0x000418, "Member 'ARangedExplosive::_owningPlayer' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _isExploding) == 0x000420, "Member 'ARangedExplosive::_isExploding' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _actorsInRange) == 0x000428, "Member 'ARangedExplosive::_actorsInRange' has a wrong offset!");
static_assert(offsetof(ARangedExplosive, _explosiveActorEffect) == 0x000438, "Member 'ARangedExplosive::_explosiveActorEffect' has a wrong offset!");

// Class DBDGameplay.AimDirectionProvider
// 0x0000 (0x0030 - 0x0030)
class UAimDirectionProvider : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimDirectionProvider">();
	}
	static class UAimDirectionProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimDirectionProvider>();
	}
};
static_assert(alignof(UAimDirectionProvider) == 0x000008, "Wrong alignment on UAimDirectionProvider");
static_assert(sizeof(UAimDirectionProvider) == 0x000030, "Wrong size on UAimDirectionProvider");

// Class DBDGameplay.AimPointProcessor
// 0x0000 (0x00B8 - 0x00B8)
class UAimPointProcessor : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimPointProcessor">();
	}
	static class UAimPointProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimPointProcessor>();
	}
};
static_assert(alignof(UAimPointProcessor) == 0x000008, "Wrong alignment on UAimPointProcessor");
static_assert(sizeof(UAimPointProcessor) == 0x0000B8, "Wrong size on UAimPointProcessor");

// Class DBDGameplay.SteamPipeEffectComponent
// 0x0078 (0x0130 - 0x00B8)
class USteamPipeEffectComponent final : public UActorComponent
{
public:
	TSubclassOf<class UStatusEffect>              _hinderedEffectClass;                              // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   _stateTagsToIgnore;                                // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTagStateBool                          _isInActiveSteamPipeZone;                          // 0x00D0(0x0048)(Net, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class ASteamPipe>              _overlappingSteamPipe;                             // 0x0118(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x10];                                     // 0x0120(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnHealthStateChanged(const struct FGameplayTag& gameplayTag, const struct FGameEventData& gameEventData);
	void Authority_OnStoppedCrouching(const struct FGameplayTag& gameplayTag, const struct FGameEventData& gameEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamPipeEffectComponent">();
	}
	static class USteamPipeEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamPipeEffectComponent>();
	}
};
static_assert(alignof(USteamPipeEffectComponent) == 0x000008, "Wrong alignment on USteamPipeEffectComponent");
static_assert(sizeof(USteamPipeEffectComponent) == 0x000130, "Wrong size on USteamPipeEffectComponent");
static_assert(offsetof(USteamPipeEffectComponent, _hinderedEffectClass) == 0x0000B8, "Member 'USteamPipeEffectComponent::_hinderedEffectClass' has a wrong offset!");
static_assert(offsetof(USteamPipeEffectComponent, _stateTagsToIgnore) == 0x0000C0, "Member 'USteamPipeEffectComponent::_stateTagsToIgnore' has a wrong offset!");
static_assert(offsetof(USteamPipeEffectComponent, _isInActiveSteamPipeZone) == 0x0000D0, "Member 'USteamPipeEffectComponent::_isInActiveSteamPipeZone' has a wrong offset!");
static_assert(offsetof(USteamPipeEffectComponent, _overlappingSteamPipe) == 0x000118, "Member 'USteamPipeEffectComponent::_overlappingSteamPipe' has a wrong offset!");

// Class DBDGameplay.AimPointPerlinNoise
// 0x0038 (0x00F0 - 0x00B8)
class UAimPointPerlinNoise final : public UAimPointProcessor
{
public:
	uint8                                         Pad_B8[0x4];                                       // 0x00B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _baseInaccuracyNoisePersistence;                   // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         _baseInaccuracyNoiseOctaveCount;                   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _baseInaccuracyNoiseAmplitude;                     // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x4];                                       // 0x00C8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _baseInaccuracyNoiseFrequency;                     // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x4];                                       // 0x00D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _timeOffset;                                       // 0x00D4(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseInaccuracyNoiseAmplitude(const float amplitude);
	void SetBaseInaccuracyNoiseFrequency(const float frequency);
	void SetBaseInaccuracyNoiseOctaveCount(const int32 octaveCount);
	void SetBaseInaccuracyNoisePersistence(const float noisePersistence);
	void SetNoiseAmplitudeMultiplier(const float multiplier);
	void SetNoiseFrequencyMultiplier(const float multiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimPointPerlinNoise">();
	}
	static class UAimPointPerlinNoise* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimPointPerlinNoise>();
	}
};
static_assert(alignof(UAimPointPerlinNoise) == 0x000008, "Wrong alignment on UAimPointPerlinNoise");
static_assert(sizeof(UAimPointPerlinNoise) == 0x0000F0, "Wrong size on UAimPointPerlinNoise");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoisePersistence) == 0x0000BC, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoisePersistence' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoiseOctaveCount) == 0x0000C0, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoiseOctaveCount' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoiseAmplitude) == 0x0000C4, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoiseAmplitude' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _baseInaccuracyNoiseFrequency) == 0x0000CC, "Member 'UAimPointPerlinNoise::_baseInaccuracyNoiseFrequency' has a wrong offset!");
static_assert(offsetof(UAimPointPerlinNoise, _timeOffset) == 0x0000D4, "Member 'UAimPointPerlinNoise::_timeOffset' has a wrong offset!");

// Class DBDGameplay.AISenseConfig_Terror
// 0x0068 (0x00B8 - 0x0050)
class UAISenseConfig_Terror final : public UAISenseConfig
{
public:
	TSubclassOf<class UAISense_Terror>            Implementation;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBreathingSoundRange;                            // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EAITerrorLevel, float>                   TerrorRanges;                                      // 0x0060(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAISenseAffiliationFilter              DetectionByAffiliation;                            // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISenseConfig_Terror">();
	}
	static class UAISenseConfig_Terror* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseConfig_Terror>();
	}
};
static_assert(alignof(UAISenseConfig_Terror) == 0x000008, "Wrong alignment on UAISenseConfig_Terror");
static_assert(sizeof(UAISenseConfig_Terror) == 0x0000B8, "Wrong size on UAISenseConfig_Terror");
static_assert(offsetof(UAISenseConfig_Terror, Implementation) == 0x000050, "Member 'UAISenseConfig_Terror::Implementation' has a wrong offset!");
static_assert(offsetof(UAISenseConfig_Terror, MaxBreathingSoundRange) == 0x000058, "Member 'UAISenseConfig_Terror::MaxBreathingSoundRange' has a wrong offset!");
static_assert(offsetof(UAISenseConfig_Terror, TerrorRanges) == 0x000060, "Member 'UAISenseConfig_Terror::TerrorRanges' has a wrong offset!");
static_assert(offsetof(UAISenseConfig_Terror, DetectionByAffiliation) == 0x0000B0, "Member 'UAISenseConfig_Terror::DetectionByAffiliation' has a wrong offset!");

// Class DBDGameplay.RespawnableComponent
// 0x0210 (0x02C8 - 0x00B8)
class URespawnableComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Cosmetic_OnRespawn;                                // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              Cosmetic_OnDespawn;                                // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              Cosmetic_OnFirstSpawn;                             // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnTeleportSucceded;                                // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	bool                                          _hasStartedRespawning;                             // 0x0128(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _hasExceededMinRespawnTime;                        // 0x0129(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayElementType                          _gameplayElementSpawnType;                         // 0x012A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ETileSpawnPointType                           _tileSpawnType;                                    // 0x012B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        _spawnElementInUse;                                // 0x0130(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _usesTimers;                                       // 0x0138(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _respawnFrequencyMin;                              // 0x0140(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDBDTunableRowHandle                   _respawnFrequencyMax;                              // 0x0168(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _disappearDuration;                                // 0x0190(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _minTimeBetweenRespawns;                           // 0x0194(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _spawnHeightOffset;                                // 0x0198(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19C[0x3C];                                     // 0x019C(0x003C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _usesGameplayElementSpawner;                       // 0x01D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D9[0x77];                                     // 0x01D9(0x0077)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _actorLocation;                                    // 0x0250(0x0018)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0x4];                                      // 0x0268(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _collisionCapsuleHalfHeight;                       // 0x026C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _collisionCapsuleRadius;                           // 0x0270(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDebugTimerLogComponent*                _debugLogTimer;                                    // 0x0278(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _onlyLimitDistanceBetweenSameActorType;            // 0x0280(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDBDTunableRowHandle                   _minDistanceFromActivatedSpawnElements;            // 0x0288(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          _allowSpawnEvenWithNonBlockingOverlaps;            // 0x02B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          _canUseFallbackSpawnElement;                       // 0x02B1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECollisionChannel>                     _collisionChannelsToCheckOnRespawn;                // 0x02B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void Authority_OnMinRespawnTimerDone();
	void Authority_OnTimerDone();
	bool Authority_TryTeleport();
	void OnDespawnCosmeticsComplete();
	void OnLevelReadyToPlay();
	void OnRep_OnLocationChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RespawnableComponent">();
	}
	static class URespawnableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URespawnableComponent>();
	}
};
static_assert(alignof(URespawnableComponent) == 0x000008, "Wrong alignment on URespawnableComponent");
static_assert(sizeof(URespawnableComponent) == 0x0002C8, "Wrong size on URespawnableComponent");
static_assert(offsetof(URespawnableComponent, Cosmetic_OnRespawn) == 0x0000E8, "Member 'URespawnableComponent::Cosmetic_OnRespawn' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, Cosmetic_OnDespawn) == 0x0000F8, "Member 'URespawnableComponent::Cosmetic_OnDespawn' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, Cosmetic_OnFirstSpawn) == 0x000108, "Member 'URespawnableComponent::Cosmetic_OnFirstSpawn' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, OnTeleportSucceded) == 0x000118, "Member 'URespawnableComponent::OnTeleportSucceded' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _hasStartedRespawning) == 0x000128, "Member 'URespawnableComponent::_hasStartedRespawning' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _hasExceededMinRespawnTime) == 0x000129, "Member 'URespawnableComponent::_hasExceededMinRespawnTime' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _gameplayElementSpawnType) == 0x00012A, "Member 'URespawnableComponent::_gameplayElementSpawnType' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _tileSpawnType) == 0x00012B, "Member 'URespawnableComponent::_tileSpawnType' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _spawnElementInUse) == 0x000130, "Member 'URespawnableComponent::_spawnElementInUse' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _usesTimers) == 0x000138, "Member 'URespawnableComponent::_usesTimers' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _respawnFrequencyMin) == 0x000140, "Member 'URespawnableComponent::_respawnFrequencyMin' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _respawnFrequencyMax) == 0x000168, "Member 'URespawnableComponent::_respawnFrequencyMax' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _disappearDuration) == 0x000190, "Member 'URespawnableComponent::_disappearDuration' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _minTimeBetweenRespawns) == 0x000194, "Member 'URespawnableComponent::_minTimeBetweenRespawns' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _spawnHeightOffset) == 0x000198, "Member 'URespawnableComponent::_spawnHeightOffset' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _usesGameplayElementSpawner) == 0x0001D8, "Member 'URespawnableComponent::_usesGameplayElementSpawner' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _actorLocation) == 0x000250, "Member 'URespawnableComponent::_actorLocation' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _collisionCapsuleHalfHeight) == 0x00026C, "Member 'URespawnableComponent::_collisionCapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _collisionCapsuleRadius) == 0x000270, "Member 'URespawnableComponent::_collisionCapsuleRadius' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _debugLogTimer) == 0x000278, "Member 'URespawnableComponent::_debugLogTimer' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _onlyLimitDistanceBetweenSameActorType) == 0x000280, "Member 'URespawnableComponent::_onlyLimitDistanceBetweenSameActorType' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _minDistanceFromActivatedSpawnElements) == 0x000288, "Member 'URespawnableComponent::_minDistanceFromActivatedSpawnElements' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _allowSpawnEvenWithNonBlockingOverlaps) == 0x0002B0, "Member 'URespawnableComponent::_allowSpawnEvenWithNonBlockingOverlaps' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _canUseFallbackSpawnElement) == 0x0002B1, "Member 'URespawnableComponent::_canUseFallbackSpawnElement' has a wrong offset!");
static_assert(offsetof(URespawnableComponent, _collisionChannelsToCheckOnRespawn) == 0x0002B8, "Member 'URespawnableComponent::_collisionChannelsToCheckOnRespawn' has a wrong offset!");

// Class DBDGameplay.AISenseEvent_Terror
// 0x0030 (0x0060 - 0x0030)
class UAISenseEvent_Terror final : public UAISenseEvent
{
public:
	struct FAITerrorEvent                         Event;                                             // 0x0030(0x0030)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISenseEvent_Terror">();
	}
	static class UAISenseEvent_Terror* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseEvent_Terror>();
	}
};
static_assert(alignof(UAISenseEvent_Terror) == 0x000008, "Wrong alignment on UAISenseEvent_Terror");
static_assert(sizeof(UAISenseEvent_Terror) == 0x000060, "Wrong size on UAISenseEvent_Terror");
static_assert(offsetof(UAISenseEvent_Terror, Event) == 0x000030, "Member 'UAISenseEvent_Terror::Event' has a wrong offset!");

// Class DBDGameplay.AISense_Terror
// 0x0060 (0x00E8 - 0x0088)
class UAISense_Terror final : public UAISense
{
public:
	TArray<struct FAITerrorEvent>                 _events;                                           // 0x0088(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x50];                                      // 0x0098(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void ReportTerrorEvent(class UObject* worldContextObj, const struct FVector& location, class AActor* instigator, class UTerrorRadiusEmitterComponent* terrorEmitter);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISense_Terror">();
	}
	static class UAISense_Terror* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISense_Terror>();
	}
};
static_assert(alignof(UAISense_Terror) == 0x000008, "Wrong alignment on UAISense_Terror");
static_assert(sizeof(UAISense_Terror) == 0x0000E8, "Wrong size on UAISense_Terror");
static_assert(offsetof(UAISense_Terror, _events) == 0x000088, "Member 'UAISense_Terror::_events' has a wrong offset!");

// Class DBDGameplay.IgnoreCollisionsBreakableHandlerComponent
// 0x0000 (0x05A0 - 0x05A0)
class UIgnoreCollisionsBreakableHandlerComponent final : public UIgnoreCollisionsHandlerComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IgnoreCollisionsBreakableHandlerComponent">();
	}
	static class UIgnoreCollisionsBreakableHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIgnoreCollisionsBreakableHandlerComponent>();
	}
};
static_assert(alignof(UIgnoreCollisionsBreakableHandlerComponent) == 0x000010, "Wrong alignment on UIgnoreCollisionsBreakableHandlerComponent");
static_assert(sizeof(UIgnoreCollisionsBreakableHandlerComponent) == 0x0005A0, "Wrong size on UIgnoreCollisionsBreakableHandlerComponent");

// Class DBDGameplay.RacoonDogComponent
// 0x0188 (0x0240 - 0x00B8)
class URacoonDogComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void()>              _cosmetic_onLookingAtTimerCompleted;               // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              _onHideActor;                                      // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              _onWasActivatedResetDebug;                         // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UDBDSkeletalMeshComponentBudgeted*      _cachedAnimatedSkeletalMesh;                       // 0x00E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x128];                                     // 0x00F0(0x0128)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          _wasActivated;                                     // 0x0218(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_219[0x1];                                      // 0x0219(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         _selectedMontageIndex;                             // 0x021A(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21B[0x5];                                      // 0x021B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRandomAnimationMontage>        _animationMontages;                                // 0x0220(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         _activationRange;                                  // 0x0230(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _secondsToLookAtActor;                             // 0x0234(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _destroyActorAfterIdleTime;                        // 0x0238(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         _precisionAngleDegrees;                            // 0x023C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Authority_OnDeleteActorTimerCompleted();
	void Authority_OnIsLookingTowardsTimerFinished();
	void Authority_OnPlayerInRangeChanged(class AActor* playerActor, const bool isInRange);
	void Authority_OnPlayerIsLookingTowardsChanged(const bool isLookingTowards, const class ADBDPlayer* player);
	void Authority_OnPossessedPawnChanged(class APawn* oldPawn, class APawn* newPawn);
	void DBD_ResetRacoonDogWasActivated();
	void DBD_SetSelectedRacoonDogAnimIndex(const uint8 index);
	void OnAnimationMontageCompleted();
	void OnRep_WasActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RacoonDogComponent">();
	}
	static class URacoonDogComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URacoonDogComponent>();
	}
};
static_assert(alignof(URacoonDogComponent) == 0x000008, "Wrong alignment on URacoonDogComponent");
static_assert(sizeof(URacoonDogComponent) == 0x000240, "Wrong size on URacoonDogComponent");
static_assert(offsetof(URacoonDogComponent, _cosmetic_onLookingAtTimerCompleted) == 0x0000B8, "Member 'URacoonDogComponent::_cosmetic_onLookingAtTimerCompleted' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _onHideActor) == 0x0000C8, "Member 'URacoonDogComponent::_onHideActor' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _onWasActivatedResetDebug) == 0x0000D8, "Member 'URacoonDogComponent::_onWasActivatedResetDebug' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _cachedAnimatedSkeletalMesh) == 0x0000E8, "Member 'URacoonDogComponent::_cachedAnimatedSkeletalMesh' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _wasActivated) == 0x000218, "Member 'URacoonDogComponent::_wasActivated' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _selectedMontageIndex) == 0x00021A, "Member 'URacoonDogComponent::_selectedMontageIndex' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _animationMontages) == 0x000220, "Member 'URacoonDogComponent::_animationMontages' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _activationRange) == 0x000230, "Member 'URacoonDogComponent::_activationRange' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _secondsToLookAtActor) == 0x000234, "Member 'URacoonDogComponent::_secondsToLookAtActor' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _destroyActorAfterIdleTime) == 0x000238, "Member 'URacoonDogComponent::_destroyActorAfterIdleTime' has a wrong offset!");
static_assert(offsetof(URacoonDogComponent, _precisionAngleDegrees) == 0x00023C, "Member 'URacoonDogComponent::_precisionAngleDegrees' has a wrong offset!");

// Class DBDGameplay.AttachKillerSpecificVaultComponent
// 0x0020 (0x00D8 - 0x00B8)
class UAttachKillerSpecificVaultComponent final : public UActorComponent
{
public:
	TSubclassOf<class UInteractionDefinition>     _vaultPalletRightInteractionClass;                 // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UInteractionDefinition>     _vaultPalletLeftInteractionClass;                  // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UInteractionDefinition>     _vaultWindowInteractionClass;                      // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Authority_OnLevelReadyToPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttachKillerSpecificVaultComponent">();
	}
	static class UAttachKillerSpecificVaultComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttachKillerSpecificVaultComponent>();
	}
};
static_assert(alignof(UAttachKillerSpecificVaultComponent) == 0x000008, "Wrong alignment on UAttachKillerSpecificVaultComponent");
static_assert(sizeof(UAttachKillerSpecificVaultComponent) == 0x0000D8, "Wrong size on UAttachKillerSpecificVaultComponent");
static_assert(offsetof(UAttachKillerSpecificVaultComponent, _vaultPalletRightInteractionClass) == 0x0000B8, "Member 'UAttachKillerSpecificVaultComponent::_vaultPalletRightInteractionClass' has a wrong offset!");
static_assert(offsetof(UAttachKillerSpecificVaultComponent, _vaultPalletLeftInteractionClass) == 0x0000C0, "Member 'UAttachKillerSpecificVaultComponent::_vaultPalletLeftInteractionClass' has a wrong offset!");
static_assert(offsetof(UAttachKillerSpecificVaultComponent, _vaultWindowInteractionClass) == 0x0000C8, "Member 'UAttachKillerSpecificVaultComponent::_vaultWindowInteractionClass' has a wrong offset!");

// Class DBDGameplay.BlockFeedbackBase
// 0x0008 (0x02B8 - 0x02B0)
class ABlockFeedbackBase : public AActor
{
public:
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlockFeedbackBase">();
	}
	static class ABlockFeedbackBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlockFeedbackBase>();
	}
};
static_assert(alignof(ABlockFeedbackBase) == 0x000008, "Wrong alignment on ABlockFeedbackBase");
static_assert(sizeof(ABlockFeedbackBase) == 0x0002B8, "Wrong size on ABlockFeedbackBase");

// Class DBDGameplay.FadingBlockFeedback
// 0x0018 (0x02D0 - 0x02B8)
class AFadingBlockFeedback : public ABlockFeedbackBase
{
public:
	class UCurveFloat*                            _fadeCurve;                                        // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x10];                                     // 0x02C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFadeOutEnded();
	void OnFadeOutStarted(const float fadeDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FadingBlockFeedback">();
	}
	static class AFadingBlockFeedback* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFadingBlockFeedback>();
	}
};
static_assert(alignof(AFadingBlockFeedback) == 0x000008, "Wrong alignment on AFadingBlockFeedback");
static_assert(sizeof(AFadingBlockFeedback) == 0x0002D0, "Wrong size on AFadingBlockFeedback");
static_assert(offsetof(AFadingBlockFeedback, _fadeCurve) == 0x0002B8, "Member 'AFadingBlockFeedback::_fadeCurve' has a wrong offset!");

// Class DBDGameplay.StaticMeshBlockFeedback
// 0x0010 (0x02E0 - 0x02D0)
class AStaticMeshBlockFeedback : public AFadingBlockFeedback
{
public:
	class UStaticMeshComponent*                   _mesh;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialHelper*                        _materialHelper;                                   // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StaticMeshBlockFeedback">();
	}
	static class AStaticMeshBlockFeedback* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStaticMeshBlockFeedback>();
	}
};
static_assert(alignof(AStaticMeshBlockFeedback) == 0x000008, "Wrong alignment on AStaticMeshBlockFeedback");
static_assert(sizeof(AStaticMeshBlockFeedback) == 0x0002E0, "Wrong size on AStaticMeshBlockFeedback");
static_assert(offsetof(AStaticMeshBlockFeedback, _mesh) == 0x0002D0, "Member 'AStaticMeshBlockFeedback::_mesh' has a wrong offset!");
static_assert(offsetof(AStaticMeshBlockFeedback, _materialHelper) == 0x0002D8, "Member 'AStaticMeshBlockFeedback::_materialHelper' has a wrong offset!");

// Class DBDGameplay.AudioBlockFeedback
// 0x0018 (0x02D0 - 0x02B8)
class AAudioBlockFeedback : public ABlockFeedbackBase
{
public:
	class UAkAudioEvent*                          _akAudioEventBlockStart;                           // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          _akAudioEventBlockStop;                            // 0x02C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           _blockableAudioComponent;                          // 0x02C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioBlockFeedback">();
	}
	static class AAudioBlockFeedback* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAudioBlockFeedback>();
	}
};
static_assert(alignof(AAudioBlockFeedback) == 0x000008, "Wrong alignment on AAudioBlockFeedback");
static_assert(sizeof(AAudioBlockFeedback) == 0x0002D0, "Wrong size on AAudioBlockFeedback");
static_assert(offsetof(AAudioBlockFeedback, _akAudioEventBlockStart) == 0x0002B8, "Member 'AAudioBlockFeedback::_akAudioEventBlockStart' has a wrong offset!");
static_assert(offsetof(AAudioBlockFeedback, _akAudioEventBlockStop) == 0x0002C0, "Member 'AAudioBlockFeedback::_akAudioEventBlockStop' has a wrong offset!");
static_assert(offsetof(AAudioBlockFeedback, _blockableAudioComponent) == 0x0002C8, "Member 'AAudioBlockFeedback::_blockableAudioComponent' has a wrong offset!");

// Class DBDGameplay.BaseActorAttackableComponent
// 0x0038 (0x00F0 - 0x00B8)
class UBaseActorAttackableComponent : public UAttackableComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  _killerProjectilesThatCanDamageActor;              // 0x00D0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void HitWithProjectile(class ABaseProjectile* projectile);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseActorAttackableComponent">();
	}
	static class UBaseActorAttackableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseActorAttackableComponent>();
	}
};
static_assert(alignof(UBaseActorAttackableComponent) == 0x000008, "Wrong alignment on UBaseActorAttackableComponent");
static_assert(sizeof(UBaseActorAttackableComponent) == 0x0000F0, "Wrong size on UBaseActorAttackableComponent");
static_assert(offsetof(UBaseActorAttackableComponent, _killerProjectilesThatCanDamageActor) == 0x0000D0, "Member 'UBaseActorAttackableComponent::_killerProjectilesThatCanDamageActor' has a wrong offset!");

// Class DBDGameplay.FootstepCreatorComponent
// 0x0050 (0x0108 - 0x00B8)
class UFootstepCreatorComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _fadeCurve;                                        // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            _veinsCurve;                                       // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFootstepManagerComponent>  _footstepManagerComponentClass;                    // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _secondsUntilFootprintTrigger;                     // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _canSpawnFootstepsDefaultValue;                    // 0x00FC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FD[0xB];                                       // 0x00FD(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootstepCreatorComponent">();
	}
	static class UFootstepCreatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepCreatorComponent>();
	}
};
static_assert(alignof(UFootstepCreatorComponent) == 0x000008, "Wrong alignment on UFootstepCreatorComponent");
static_assert(sizeof(UFootstepCreatorComponent) == 0x000108, "Wrong size on UFootstepCreatorComponent");
static_assert(offsetof(UFootstepCreatorComponent, _fadeCurve) == 0x0000D8, "Member 'UFootstepCreatorComponent::_fadeCurve' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _veinsCurve) == 0x0000E0, "Member 'UFootstepCreatorComponent::_veinsCurve' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _footstepManagerComponentClass) == 0x0000E8, "Member 'UFootstepCreatorComponent::_footstepManagerComponentClass' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _secondsUntilFootprintTrigger) == 0x0000F8, "Member 'UFootstepCreatorComponent::_secondsUntilFootprintTrigger' has a wrong offset!");
static_assert(offsetof(UFootstepCreatorComponent, _canSpawnFootstepsDefaultValue) == 0x0000FC, "Member 'UFootstepCreatorComponent::_canSpawnFootstepsDefaultValue' has a wrong offset!");

// Class DBDGameplay.SurvivorFootstepCreatorComponent
// 0x0238 (0x0340 - 0x0108)
class USurvivorFootstepCreatorComponent : public UFootstepCreatorComponent
{
public:
	TArray<struct FGameplayTag>                   _disallowFootstepsSpawnPerkFlags;                  // 0x0108(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FStatProperty                          _footstepIndicatorAngle;                           // 0x0118(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
